backend/controllers/AdminGoodsController.php

SELECT * FROM `t_goods` WHERE `goods_id`='1'
---
    protected function findModel($id)
    {
        if (($model = GoodsModel::findOne($id)) !== null) {