common/models/guanli_dingdan/CartSearch.php

SELECT `goods_attr`, `g`.`goods_name`, `g`.`market_price`, `g`.`shop_price`, `g`.`goods_number`, `g`.`goods_id` FROM `t_cart` LEFT JOIN `t_goods` `g` ON `t_cart`.`goods_id` = `g`.`goods_id` WHERE `session_id`='26s6lc97un7ag0thn8039ovt61'
---
    public static function getGouwuche(){
        $session= Yii::$app->session;
        (!$session->isActive)?$session->open():'';
        $cart_model= self::find()
            ->select(['goods_attr','g.goods_name','g.market_price','g.shop_price','g.goods_number','g.goods_id'])
            ->where(['session_id'=>$session->id])
            ->joinWith(['goodsModel g'])->asArray()->all();