backend/views/admin-menu/_form.php

use \yii\helpers\ArrayHelper;
use \common\components\ec\backend\EcMenuManageWidget;
use\common\components\eleme\ElJilianCascaderWidget;
$parents=MenuModel::find()->select(['id','name'])->asArray()->all();
---
SELECT `id`, `name` FROM `menu`