backend/views/admin-auth-item-child/_form.php

use yii\widgets\ActiveForm;
use \common\models\guanli_quanxian\AuthItemChildModel;
use \yii\helpers\Url;
$ps=AuthItemChildModel::find()->select(['name','parent'])->joinWith(['authItemParent'])->groupBy(['parent'])->asArray()->all();
---
SELECT `name`, `parent` FROM `t_auth_item_child` LEFT JOIN `t_auth_item` ON `t_auth_item_child`.`parent` = `t_auth_item`.`name` GROUP BY `parent`