common/models/guanli_quanxian/BackendUser.php

    public static function findByUsername($username)
    {
        return AdminUser::findOne([
            'uname' => $username,
            'status' => self::STATUS_ACTIVE
        ]);
---
SELECT * FROM `admin_user` WHERE (`id`='156') AND (`status`=10)