common/models/guanli_quanxian/MenuHelper.php

SELECT `id`, `name`, `parent`, `route`, `data` FROM `menu`
---
    public static function getAssignedMenu($userId, $allmenu=false,$root = null, $callback = null, $refresh = false)
    {
       //获取菜单列表
         $query=MenuModel::find();
         //带权限的
        if ($allmenu==false){
            $auth = Yii::$app->getAuthManager();
            $permissions=$auth->getPermissionsByUser($userId);
            $routes=array_keys($permissions);
            $query= $query->where(['route'=>$routes]);
        }
        //不带权限的
        $menus =$query->select(['id','name','parent','route','data',])->all();