common/models/guanli_xitong/ShippingSearch.php

SELECT * FROM `t_shipping` WHERE `enabled`=1
---
    public static function getWuliuBiao()
    {
        return json_encode(ShippingModel::find()->where(['enabled' => 1])->asArray()->all(), JSON_UNESCAPED_UNICODE);

SELECT `configure` FROM `t_shipping_area`
---
     public static function getShip()
    {
        return ShippingAreaModel::find()->select(['configure'])->asArray()->all();