common/components/ec/frontend/EcFooterWidget.php

SELECT `title`, `article_id` FROM `t_article` WHERE `cat_id`=2
---
    public function init()
    {
        //帮助文章
       $this->helps=json_encode(ArticleCatModel::find()->where(['cat_type'=>5])->joinWith(['articleModel'])->asArray()->all());
       //底部联系我们那些
        $this->aboutItems=json_encode(ArticleModel::find()->where(['cat_id'=>2])->select(['title','article_id',])->asArray()->all());