common/components/ec/frontend/EcJingpinTuijianWidget.php

SELECT `goods_id`, `goods_name`, `goods_thumb`, `goods_name`, `shop_price` FROM `t_goods` WHERE `is_best`=1
---
    public function init()
    {
        $this->url=Yii::getAlias($this->url);
        $this->items=json_encode(GoodsModel::find()->select(['goods_id','goods_name','goods_thumb','goods_name','shop_price'])
            ->where(['is_best'=>1])->asArray()->all());