common/components/ec/frontend/EcPinPaiWidget.php

    public function init()
    {
        $this->url=Yii::getAlias($this->url);
        $this->items=json_encode(BrandModel::find()->select(['brand_id','brand_name','brand_logo'])->where(['not',['brand_logo'=>'']])->asArray()->all());
---
SELECT `brand_id`, `brand_name`, `brand_logo` FROM `t_brand` WHERE NOT (`brand_logo`='')