common/components/ec/frontend/EcReMaiWidget.php

    public function init()
    {
        $this->url=Yii::getAlias($this->url);
        $this->items=json_encode(GoodsModel::find()->select(['goods_id','shop_price','goods_name','goods_thumb'])->where(['is_hot'=>1])->limit(15)
            ->asArray()->all());
---
SELECT `goods_id`, `shop_price`, `goods_name`, `goods_thumb` FROM `t_goods` WHERE `is_hot`=1 LIMIT 15