common/components/ec/frontend/EcSearchWidget.php

    public function init()
    {
        $items=CategoryModel::find()->asArray()->all();
---
SELECT * FROM `t_category`