common/components/ec/frontend/EcXinpinWidget.php

    public function init()
    {
        $this->items=json_encode(GoodsModel::find()->select(['goods_id','shop_price','goods_name','goods_thumb'])->where(['is_new'=>1])
            ->asArray()->all());
---
SELECT `goods_id`, `shop_price`, `goods_name`, `goods_thumb` FROM `t_goods` WHERE `is_new`=1